---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterRule
source: html/e09eea99-5be5-34b7-0ade-5fda58319fc8.htm
---
# FilterRule Properties

Specifies whether the .NET object represents a valid Revit entity.